# Пользователь вводит число, нужно вывести чило pi с заданной точностью(БЕЗ БИБЛИОТЕК/МОДУЛЕЙ)

print('Введите требуемую точность числа Пи, n:')
n = int(input())

pi = 0
k = 0

while k < n:
    pi += (round(1)/(16**k))*((round(4)/(8*k+1))-(round(2)/(8*k+4))-(round(1)/(8*k+5))-(round(1)/(8*k+6)))
    k += 1

print(round(pi, n))